[
  {
    "title": "npm create vue@lattest",
    "imagePath": "../assets/slides/1.jpg",
    "text": "И так начнем наше знакомство с Vue.js3 и продолжим дружбу с такими технологиями как: JavaScript, TypeScript, HTML, CSS, Node.Js и npm. Степы уроков буду проходить подобным образом. На картинке будет изображено, то, что делаю я, а тут справа будет пояснение того, что я делаю. Ну, начнем. Пока просто смотри. Я на данном степе создаю шаблон проекта Vue.js. Разработчики этого фреймфорка позаботились и оставили в репозитории утилиту 'create vue'б которую с помощью данной команды я использую. Если она есть она просто запуститься, а если нет, то скачается и запустится. Здесь я обращаюсь к npm и запускаю утилиту create vue@latest. Команда говорит сама за себя. npm - node.js package manager (напоминаю: пакетный менеджер нашей платформы разработки). create(наверное создать). vue(создаем приложение vue), ну а @latest указывает на то, что будем использовать последнюю версию этой утилиты. Если дочитала, то листай в право!"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/2.jpg",
    "text": "Ну-ка что там. Ого, из-за того, что я использую последнюю версию утилиты create vue. У меня утилиты спрашивает, хочу ли я установить последнюю версию самого фреймворка vue. Ввожу в консоли y - yes и нажимаю enter"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/3.jpg",
    "text": "Указываю имя проекта, просто вводя текст"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/4.jpg",
    "text": "Указал и снова enter"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/5.jpg",
    "text": "Выбрать TypeScript? Ну ясен хуй! Не зря же ебались с ним. (Стрелочками лево/право выбирю и снова enter.)"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/6.jpg",
    "text": "Тут пока что-то для нас не понятное. Не будем его добавлять (Стрелочками выбираем и снова enter)"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/7.jpg",
    "text": "Тут пока тоже не нужное"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/8.jpg",
    "text": "И тут пока тоже не нужное"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/9.jpg",
    "text": "Обойдемся пока без встроеного unit тестирования (если помнишь у нас в прошлых уроках были тесты)"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/10.jpg",
    "text": "И обойдемся без end-to-end тестов"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/11.jpg",
    "text": "Снова NO"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/12.jpg",
    "text": "И снова NO"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/13.jpg",
    "text": "Мы не суеверные но на 13 шагенаше Vue приложение готово к запуску. А утилита нам даже кричит, как это все дело запустить. Проект создавался с именем 'lesson', поэтому для него в нашем репозитории создалась отдельная папка. Утилита говорит, что надо выполнить cd lesson, чтобы перейти в папку проекта. Потом выполнить npm install или npm i, чтобы установились все нужные зависимости. А потом npm run dev, чтобы запустить само приложение. Покорно выполняем"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/14.jpg",
    "text": "В папку перешли. Можно ещё увидеть, как наш текущий путь изменился"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/15.jpg",
    "text": "Калабахаем 'npm i' или 'npm install' эти команды эквивалентны. И видим, что у нас скачались 62 пакета. Все это зависимости для нашего приложения. Нам в подробности вдаваться не придется"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/16.jpg",
    "text": "Теперь ебурим команду npm run dev(Кстати, на нее можно посмотреть в файлике package.json в секции scripts). И нам в консольке напишут, что все готово и приложение запущено по ниже указанному адресу!!!"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/17.jpg",
    "text": "Можно туда даже перейти и посмотреть, шо там есть. Там нас приветствует Vue, благодорит, что мы его выбрали и много всякой другой хуйни. Предлагаю посмотреть на структуру проекта, который у нас создался"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/18.jpg",
    "text": "И так, вот она, наша структура проекта. В дальнейшем она будет тебе очень знакома. Тут куча всякого говна, типа README и всякие gitignor`s, config` и всякие там json`ы. Нам на них пока что класть. Они нужны для всякой настроечной хуйни."
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/19.jpg",
    "text": "Но вот, что реально интересно. Тут есть какой-то index.html. Тут есть какой-то заголовок title, ссылка на css, иконка favicon.ico. Все это находится в head. А в body html Всего лишь один div с айдишником app и какой-то скрипт."
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/20.jpg",
    "text": "Кстати, вот где используются title и иконка: на вкладке браузера"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/21.jpg",
    "text": "Посмотрим далее, в папку src, что является сокращением от source - исходный. Исходный код. Здесь есть две папки: assets - служит длявсяких картинок иконок и тд. Кстати картинки к слайдам я храню именно тут. И components - служит для хранения компонентов. Vue - фреймворк, как и многий пропогадирующий компонентный подход. Это значит, что мы не пишем наше приложение в в одном html, а логику описываем в одном .js или .ts файле. Это значит, что мы опысываем каждый компонент отдельно, а потом уже из этих компонентов собираем страницу, как конструктор. Это большой плюс для менеджмента кода и его переиспользования."
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/22.jpg",
    "text": "Вот содержимое папки assets. Здесь положили base.css. Который описывает, какие цвета и шрифты есть на странице. main.css - отвечает за разметку. А logo.svg - это просто векторное изображение"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/23.jpg",
    "text": "Кстати, вот оно, logo.svg. Зеленая буква V - логотип Vue"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/24.jpg",
    "text": "(сука я удалил картинку этого слайда случайно). Взгялянем в папку components. Тут у нас есть сами компоненты. Они опысываются в файлах с расширением .vue. Здесь есть 3 компонента, которые мы можем увидеть на странице. HelloWorld.vue - это компонент с зеленой V, мотивирующим текстом 'You did it!' и еще какой-то хуйней. WelcomeItem.vue - там описана разметка и поведения маленьких хуйнюшек справа. А TheWelcome.vue - это сам список этих хуйнюшек. (Можно перейти на слайд назад и найти их) Также тут есть папка icons. Инога картинки тоже оформляют в виде компонентов, чтобы переиспользовать где-нибудь в другом месте. Здесь в папке icons описаны иконки каждого элемента из списка"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/25.jpg",
    "text": "Посмотрим на корневой компонент App.vue"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/26.jpg",
    "text": "Посмотрим на корневой компонент App.vue (Эх, нихуя не видно. Там по идее я просто показываю где в этом App.vue находится код, и куда он в итоге рендерится на странице) Благо таких уебищных скринов всего 3. Раз"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/27.jpg",
    "text": "Два"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/28.jpg",
    "text": "Три. Красота. А теперь я нахер удалю эти все компоненты. Оставлю только App.vue. Перезапущу приложение иииии"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/29.jpg",
    "text": "Ииии получу кучу ошибок"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/30.jpg",
    "text": "Тут, конечно, плохо видно, но но тут у нас приложение ругается, потому что удалил компоненты, которые используем в App.vue"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/31.jpg",
    "text": "Мы должны будем удалить их из App.vue"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/32.jpg",
    "text": "Вот мы удалили их из import`ов и в самом шаблоне"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/33.jpg",
    "text": "Теперь приложение не ругается и запускается"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/34.jpg",
    "text": "В корневом компоненте App.vue остались стили. Их тоже удалим из секции style"
  },
  {
    "title": "Создаем vue приложение",
    "imagePath": "../assets/slides/35.jpg",
    "text": "Удалим css`ки из папки assets"
  }
]
