// Написать функцию largestCommonSubstring, которая принимает в качестве параметров две строки: str1 и str2. И Возвращает наибольшую общую подстроку, УЧИТЫВАЯ ПРОБЕЛЫ
// Пример: 
// str1 = "Даше нравится кодить на JavaScript"
// str2 = "Программистам на Java нравится пить кофе"
//
// P.S. В str1 и str2 много общих подстрок, например " на Java", "ить", и даже " " будет считаться общей подстрокой, так как обе строки содержат пробелы. Но надо найти наибольшую
// 
// Результат выполнения функции: " нравится "

const largestCommonSubstring = (str1, str2) => {
  // ТУТ
  // ТВОЙ
  // КОД
}

module.exports = largestCommonSubstring
