class Student {
// Надо реализовать класс Student, объекты которого смогут хранить
// информацию об ученике и о том, какие у него оценки и по каким предметам
}

class Mark {
// Надо реализовать класс отметки, объекты которого смогут хранить информацию о том,
//  какая оценка по той или иной дисциплине
}

// В идеале конечно раскидать все эти классы по разным файликам

function getInfo(students: Student[]): void {
// Надо реализовать функцию, которая в качестве параметров принимает массив объектов типа студент
//  которая выводила бы в консоль информацию о об успеваемости студентов,
// их оценки, средние баллы и средние баллы по дисциплинам
}